In [5]:
dictt={"familymembers":["sul","raz","zub","zain","tab","irf","suf","zam","zah","tam"],"relation":["dad","mom","hub","son","sis1","sis2","bro","bro1","inlaw","daughter"]}

In [2]:
dictt

{'familymembers': ['sul',
  'raz',
  'zub',
  'zain',
  'tab',
  'irf',
  'suf',
  'zam',
  'zah',
  'tam'],
 'relation': ['dad',
  'mom',
  'hub',
  'son',
  'sis1',
  'sis2',
  'bro',
  'bro1',
  'inlaw',
  'daughter']}

In [8]:
dictt["familymembers"]

['sul', 'raz', 'zub', 'zain', 'tab', 'irf', 'suf', 'zam', 'zah', 'tam']

In [10]:
dictt["familymembers"][8:10]

['zah', 'tam']

In [11]:
dictt["relation"]

['dad',
 'mom',
 'hub',
 'son',
 'sis1',
 'sis2',
 'bro',
 'bro1',
 'inlaw',
 'daughter']

In [12]:
dictt["relation"][:9]

['dad', 'mom', 'hub', 'son', 'sis1', 'sis2', 'bro', 'bro1', 'inlaw']

In [13]:
dictt["familymembers"][-3:]

['zam', 'zah', 'tam']

In [14]:
dictt["familymembers"][:-5]

['sul', 'raz', 'zub', 'zain', 'tab']

In [15]:
dictt["familymembers"][0:-5]

['sul', 'raz', 'zub', 'zain', 'tab']

In [16]:
dictt["familymembers"][5],dictt["relation"][5]

('irf', 'sis2')

In [17]:
print(dictt["familymembers"][5],dictt["relation"][5])

irf sis2

In [20]:
print(dictt["familymembers"][5],dictt["relation"][5])

irf sis2

In [26]:
lst=["tab","zub","zain","zam","tam"]

for p in lst:
    print (p)

tab
zub
zain
zam
tam

In [27]:
for z in dictt:
    print(z)

familymembers
relation

In [28]:
import pandas as pd

In [30]:
df=pd.DataFrame(dictt)

In [31]:
df

  familymembers  relation
0           sul       dad
1           raz       mom
2           zub       hub
3          zain       son
4           tab      sis1
5           irf      sis2
6           suf       bro
7           zam      bro1
8           zah     inlaw
9           tam  daughter

In [36]:
df[(df['relation']=='bro') | (df['familymembers']=='zam')]

  familymembers relation
6           suf      bro
7           zam     bro1

In [2]:
boys={"boysfriendnames":["santosh","dinesh","anwar","khaja","imran"],"quality":["intelligent","silent","talktive","funny","smart"]}

girls={"girsfriendnames":["jaisree","shabana","parveen","anusha","afzal"],"quality":["smart","cool","writer","teacher","fool"],"city":["pamaru","nidumolu","pathanpeta","guduru","akulamannad"]}

In [3]:
import pandas as pd

df=pd.DataFrame(boys)

df1=pd.DataFrame(girls)

In [4]:
df

  boysfriendnames      quality
0         santosh  intelligent
1          dinesh       silent
2           anwar     talktive
3           khaja        funny
4           imran        smart

In [5]:
df1

  girsfriendnames  quality         city
0         jaisree    smart       pamaru
1         shabana     cool     nidumolu
2         parveen   writer   pathanpeta
3          anusha  teacher       guduru
4           afzal     fool  akulamannad

In [6]:
import pandas as pd

In [7]:
df_append=pd.concat([df,df1],axis=0)

In [8]:
df_append

  boysfriendnames      quality girsfriendnames         city
0         santosh  intelligent             NaN          NaN
1          dinesh       silent             NaN          NaN
2           anwar     talktive             NaN          NaN
3           khaja        funny             NaN          NaN
4           imran        smart             NaN          NaN
0             NaN        smart         jaisree       pamaru
1             NaN         cool         shabana     nidumolu
2             NaN       writer         parveen   pathanpeta
3             NaN      teacher          anusha       guduru
4             NaN         fool           afzal  akulamannad

In [9]:
df_append=pd.concat([df,df1],axis=1)

In [10]:
df_append

  boysfriendnames      quality girsfriendnames  quality         city
0         santosh  intelligent         jaisree    smart       pamaru
1          dinesh       silent         shabana     cool     nidumolu
2           anwar     talktive         parveen   writer   pathanpeta
3           khaja        funny          anusha  teacher       guduru
4           imran        smart           afzal     fool  akulamannad

In [12]:
df_append=pd.concat([df,df1],axis=0,ignore_index="true")

In [13]:
df_append

  boysfriendnames      quality girsfriendnames         city
0         santosh  intelligent             NaN          NaN
1          dinesh       silent             NaN          NaN
2           anwar     talktive             NaN          NaN
3           khaja        funny             NaN          NaN
4           imran        smart             NaN          NaN
5             NaN        smart         jaisree       pamaru
6             NaN         cool         shabana     nidumolu
7             NaN       writer         parveen   pathanpeta
8             NaN      teacher          anusha       guduru
9             NaN         fool           afzal  akulamannad

In [14]:
df_append=pd.concat([df,df1],axis=1,ignore_index="true")

In [15]:
df_append

         0            1        2        3            4
0  santosh  intelligent  jaisree    smart       pamaru
1   dinesh       silent  shabana     cool     nidumolu
2    anwar     talktive  parveen   writer   pathanpeta
3    khaja        funny   anusha  teacher       guduru
4    imran        smart    afzal     fool  akulamannad